;Place localized text in this file


[MechanicWOTC X2SoldierClassTemplate]
DisplayName="Mechanic"
ClassSummary="The Mechanic specializes best in assisting in all manners regarding Robotics, though they're just as capable in assisting the rest of a team via liberal use of Holo-Targeting."

AbilityTreeTitles[0]="Targeter"
AbilityTreeTitles[1]="Overtuner"
AbilityTreeTitles[2]="Manipulator"
AbilityTreeTitles[3]="XCOM"

[SupplicationProtocol X2AbilityTemplate]
LocFriendlyName="Supplication Protocol"
LocLongDescription="Apply 3 points of Ablative Armor onto one target, doubled effects on Robotics."
LocHelpText="Target: +3 Shield HP (x2 if Robotic)"

[EradicationProtocol X2AbilityTemplate]
LocFriendlyName="Eradication Protocol"
LocLongDescription="Gives +2 Damage and +3 Crit Damage to one target."
LocHelpText="Target: +2 DMG & +3 Crit DMG"

[OptimizationProtocol X2AbilityTemplate]
LocFriendlyName="Optimization Protocol"
LocLongDescription="Gives +20 Aim and +10% Crit Chance to one target."
LocHelpText="Target: +20 Aim & +10% Crit Chance"

[ResidentVirus X2AbilityTemplate]
LocFriendlyName="Resident Virus"
LocLongDescription="Apply -3 Damage and -4 Crit Damage onto an enemy target. Double effects on Robotics."
LocHelpText="Target: -3 DMG & -4 C.DMG (x2 if Robotic)"

[DDoSVirus X2AbilityTemplate]
LocFriendlyName="DDoS Virus"
LocLongDescription="Applies -20 Aim and -8% Crit Chance in an AOE."
LocHelpText="AOE: -20 Aim & -8% Crit"

[RootkitVirus X2AbilityTemplate]
LocFriendlyName="Rootkit Virus"
LocLongDescription="Applies -9 Mobility and -60 Tech Strength onto a Robotic target. Cannot hit Organics."
LocHelpText="Target: -9 Mobility & -60 Hack Defense (Robotics Only)"

[FatalExceptionExploit X2AbilityTemplate]
LocFriendlyName="Fatal Exception Exploit"
LocLongDescription="Gain Permanent control over one Robotic unit for the rest of the mission."
LocHelpText="Target: Permanent Control (Robotics Only)"

[HCFExploit X2AbilityTemplate]
LocFriendlyName="Halt & Catch Fire Exploit"
LocLongDescription="Apply Stun, -30 Defense, Rupture, and Shred 2 Armor to one Robotic target."
LocHelpText="Target: Stun, -30 Def, Rupture, -2 Armor (Robotics Only)" 